app/controllers/tournynames_controller.rb

SELECT `tournynames`.* FROM `tournynames`
---
  def index
    @tournynames = Tournyname.all

SELECT `tournynames`.* FROM `tournynames` WHERE `tournynames`.`id` = 1 LIMIT 1
---
  def show
    @tournyname = Tournyname.find(params[:id])

SELECT `tournynames`.* FROM `tournynames` WHERE `tournynames`.`id` = 1 LIMIT 1
---
  def edit
    @tournyname = Tournyname.find(params[:id])

INSERT INTO `tournynames` (`email`, `name`, `steam`) VALUES (NULL, NULL, NULL)
---
  def create
    @tournyname = Tournyname.new(params[:tournyname])

    respond_to do |format|
      if @tournyname.save

SELECT `tournynames`.* FROM `tournynames` WHERE `tournynames`.`id` = 1 LIMIT 1
---
  def update
    @tournyname = Tournyname.find(params[:id])